### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [43]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
Hero = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(Hero)

## Player Count

* Display the total number of players

In [44]:
Total_players = purchase_data['SN'].value_counts()

In [45]:
Total_players = Total_players.count()

In [46]:
Total_players

576

In [5]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [6]:
Unique_items = purchase_data['Item Name'].value_counts()
len(Unique_items)

179

In [7]:
Average_price = purchase_data['Price'].mean()
Average_price.round(decimals=2)

3.05

In [50]:
Summary_data = pd.DataFrame()

In [51]:
Summary_data.insert(0, "Number of Unique Items", [len(Unique_items)], True)

In [52]:
Summary_data.insert(1,"Average Price", [Average_price.round(decimals=2)])

In [53]:
Summary_data.head()

   Number of Unique Items  Average Price
0                     179           3.05

In [12]:
Num_Purchases = purchase_data['Purchase ID'].count()
Num_Purchases

780

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [13]:
Summary_data.insert(2,"Number of Purchases",[Num_Purchases])

In [14]:
Summary_data.head()

   Number of Unique Items  Average Price  Number of Purchases
0                     179           3.05                  780

In [15]:
Total_Revenue = purchase_data['Price'].sum()
Total_Revenue

2379.77

In [16]:
Summary_data.insert(3, "Total Revenue", [Total_Revenue])

In [17]:
Summary_data.head()

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179           3.05                  780        2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [18]:
Gender_Demo = purchase_data[['SN','Gender','Age']]

In [19]:
Gender_Demo = Gender_Demo.drop_duplicates()

In [20]:
Gender = Gender_Demo['Gender'].value_counts()
Gender_per = (Gender/Total_players)*100
Gender_per = Gender_per.round(decimals=2)

In [21]:
Gender_stats = pd.DataFrame({"Total Count": Gender, "Percentage of Player": Gender_per})

In [22]:
Gender_stats

                       Total Count  Percentage of Player
Male                           484                 84.03
Female                          81                 14.06
Other / Non-Disclosed           11                  1.91

In [23]:
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [24]:
purchase_data.head()
purchase_count = pd.DataFrame({"Purchase Count": purchase_data.groupby(['Gender'])['Item ID'].count(), "Average Purchase Price": purchase_data.groupby(['Gender'])['Price'].mean().round(decimals=2), "Total Purchase Value": purchase_data.groupby(['Gender'])['Price'].sum(), "Avg Total Purchase per Person": ((purchase_data.groupby(['Gender'])['Price'].sum())/Gender_stats['Total Count']).round(decimals=2)})

In [25]:
purchase_count

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Female,113,3.20,361.94,4.47
Male,652,3.02,1967.64,4.07
Other / Non-Disclosed,15,3.35,50.19,4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [26]:
Gender_Demo['Age'].describe()

count    576.000000
mean      22.741319
std        6.838568
min        7.000000
25%       19.000000
50%       22.000000
75%       25.000000
max       45.000000
Name: Age, dtype: float64

In [27]:
age_bins = pd.DataFrame()
labels=["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]
bins = [0,9,14,19,24,29,34,39,50]
age_bins["Total Count"] =  pd.cut(Gender_Demo['Age'], bins=bins, labels= labels, ordered = True).value_counts(sort=False)
age_bins

       Total Count
<10             17
10-14           22
15-19          107
20-24          258
25-29           77
30-34           52
35-39           31
40+             12

In [28]:
age_bins
per_players = ((age_bins['Total Count']/Total_players)*100).round(decimals=2)
per_players
age_bins.insert(1, "Percentage of Players", per_players)

In [29]:
age_bins.dtypes

Total Count                int64
Percentage of Players    float64
dtype: object

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [30]:
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [31]:
bn = [0,9,14,19,24,29,34,39,50]
bin_label = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]
bins = pd.cut(purchase_data['Age'], bins = bn, labels = bin_label)

In [32]:
purchase = pd.DataFrame(purchase_data[['SN', 'Age', 'Price']]) 
purchase = purchase.groupby(bins)['Price'].agg(['count', 'sum', 'mean']).round(decimals=2)
purchase = purchase.rename(columns={"count": "Purchase Count", "sum": "Total Purchase Value", "mean": "Average Purchase Price"})
purchase

       Purchase Count  Total Purchase Value  Average Purchase Price
Age
<10                23                 77.13                    3.35
10-14              28                 82.78                    2.96
15-19             136                412.89                    3.04
20-24             365               1114.06                    3.05
25-29             101                293.00                    2.90
30-34              73                214.00                    2.93
35-39              41                147.67                    3.60
40+                13                 38.24                    2.94

In [ ]:
## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [33]:
top_spenders = purchase_data.groupby('SN')['Price'].agg(['count', 'mean']).sort_values(by='count', ascending=False )
top_spenders

              count      mean
SN
Lisosia93         5  3.792000
Iral74            4  3.405000
Idastidru52       4  3.862500
Asur53            3  2.480000
Inguron55         3  3.703333
...             ...       ...
Hala31            1  1.020000
Haisurra41        1  4.400000
Hailaphos89       1  3.810000
Haestyphos66      1  1.970000
Iskosian40        1  3.070000

[576 rows x 2 columns]

In [34]:
top_spenders['Total Purchase Value'] = top_spenders['count'] * top_spenders['mean']

In [35]:
top_spenders = top_spenders.rename(columns={"count": "Purchase Count", "mean": "Average Purchase Price"})
top_spenders = top_spenders.head(5).round(decimals=2)
top_spenders

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                    3.79                 18.96
Iral74                    4                    3.40                 13.62
Idastidru52               4                    3.86                 15.45
Asur53                    3                    2.48                  7.44
Inguron55                 3                    3.70                 11.11

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [36]:
item= purchase_data[['Item ID', 'Item Name', 'Price']]

In [37]:
item = item.groupby(['Item ID','Item Name'])['Price'].agg(['count', 'sum'])

In [38]:
item

                                                      count    sum
Item ID Item Name
0       Splinter                                          4   5.12
1       Crucifer                                          4  11.77
2       Verdict                                           6  14.88
3       Phantomlight                                      6  14.94
4       Bloodlord's Fetish                                5   8.50
...                                                     ...    ...
178     Oathbreaker, Last Hope of the Breaking Storm     12  50.76
179     Wolf, Promise of the Moonwalker                   6  26.88
181     Reaper's Toll                                     5   8.30
182     Toothpick                                         3  12.09
183     Dragon's Greatsword                               3   3.27

[179 rows x 2 columns]

In [39]:
item = item.sort_values(by='count', ascending=False).head(6).rename(columns={"count": "Purchase Count", "sum": "Total Purchase Value"})

In [40]:
item

,,Purchase Count,Total Purchase Value
Item ID,Item Name,,
92,Final Critic,13,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,50.76
145,Fiery Glass Crusader,9,41.22
132,Persuasion,9,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,31.77
82,Nirvana,9,44.10

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [41]:
Most_profitable = item.sort_values(by='Total Purchase Value', ascending=False)

In [42]:
Most_profitable

,,Purchase Count,Total Purchase Value
Item ID,Item Name,,
92,Final Critic,13,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,50.76
82,Nirvana,9,44.10
145,Fiery Glass Crusader,9,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,31.77
132,Persuasion,9,28.99